<template lang="html">
  <div class="container">
    <scroll class="scroll">
      <div class="inner">
        <h2 class="title">欢迎使用“洋葱视频”！</h2>
        <p class="text">本《软件许可使用协议》（下称《协议》）是您(下称“您”或“用户”)与北京好物时代科技有限公司（下称“好物”)之间，就使用“洋葱视频”软件所达成的协议。<br>
  请务必认真阅读和理解本《协议》中规定的所有权利和限制。除非您接受本《协议》条款，否则您无权下载、安装或使用本"软件"及其相关服务。您一旦安装、复制、下载、访问或以其它方式使用本软件产品，将视为对本《协议》的接受，即表示您同意接受本《协议》各项条款的约束。如果您不同意本《协议》中的条款，请不要安装、复制或使用本软件。<br>
  您在使用软件时，应该是年满18周岁的完全民事行为能力人。如您未满18周岁，请您在使用软件服务前，征得您的监护人的书面同意。<br>
  1、权利声明
  “洋葱视频”指一款由好物合法拥有并运营的、名称为“洋葱视频”的客户端应用程序及相关网站。<br>
  “用户”指所有直接或间接获取和使用“洋葱视频”软件及相关服务的使用者，包括自然人、法人和其他组织等。<br>
  洋葱视频仅为用户提供信息存储空间的网络技术服务。用户可通过洋葱视频相关平台上传、发布或传输相关内容，包括但不限于文字、图形、图片、声音、音乐、视频、链接等信息或其他资料（下称“内容”），除非有相反证明，洋葱视频将视用户在我方平台上传、发布或传输的内容已经获得相关合法授权。如因用户在洋葱视频上传、发布的内容发生了权利纠纷或侵犯了第三方合法权益，由用户承担全部法律责任。<br>
  <span class="sm-title">2、软件许可范围</span>
  2.1 下载、安装和使用：“洋葱视频”为免费软件，用户可以非商业性、无限制数量地下载、安装及使用。
  2.2 复制、分发和传播：用户可以非商业性、无限制数量地复制、分发和传播“洋葱视频”软件。但必须保证每一份复制、分发和传播都是完整和真实的, 包括所有有关“洋葱视频”的软件、电子文档，版权和商标，亦包括本《协议》。<br>
  <span class="sm-title">3、用户权利限制</span>
  3.1 禁止反向工程、反向编译和反向汇编：用户不得对“洋葱视频”软件产品进行反向工程（Reverse Engineer）、反向编译（Decompile）或反向汇编（Disassemble），同时不得改动编译在程序文件内部的任何资源。除法律、法规明文规定允许上述活动外，用户必须遵守此协议限制。<br>
  3.2 组件分割: “洋葱视频”软件产品是作为一个单一产品而被授予许可使用, 用户不得将各个部分分开用于任何目的。<br>
  3.3 个别授权: 如需进行商业性的销售、复制、分发，包括但不限于软件销售、预装、捆绑等，必须获得好物的书面授权和许可。<br>
  3.4 保留权利：本协议未明示授权的其他一切权利仍归好物所有， 用户使用其他权利时必须获得好物的书面同意。<br>
  <span class="sm-title">4、注册“洋葱视频”账号</span>
  4.1 用户可以根据对“洋葱视频”服务的使用需求，自行决定是否申请注册账号。<br>
  4.2 如用户选择申请注册账号，应按照“洋葱视频”的规则的字符组合作为账户名。账户名不得违反法律规定、不得含有不良信息。<br>
  4.3 “洋葱视频”的账户所有权归好物所有，您享有使用权。账号名及您自行设置的密码是您登录“洋葱视频”、使用并接受服务的凭证。您应妥善保管账户及密码。如因您个人原因导致盗号或是密码失窃等情形的，由您自行承担一切后果。<br>
  4.4 账户仅限您个人使用，禁止赠予、借用、出租、出售。如您在注册、登录、使用账户过程存在违反法律法规政策，或是“洋葱视频”的规则，好物有权根据情形随时暂停、终止账户的使用、注销账户。<br>
  <span class="sm-title">5、软件使用须知</span>
  5.1 本软件是基于iOS系统开发的一款手机客户端视频资讯内容上传、搜索软件。用户可以自行搜索相关视频资讯内容，也可以通过本软件定制相关的视频资讯内容，方便浏览查看。<br>
  5.2 本软件仅适用于官方网站公布支持的操作系统（即iOS系统），如果用户在安装本软件后因任何原因欲放弃使用，可使用iOS系统相应方式删除本软件。<br>
  5.3 本软件由好物提供产品支持。<br>
  5.4 软件的修改和升级：好物保留随时为用户提供本软件的修改、升级版本的权利。由用户选择确定后，软件会进行升级更新，产生相应的数据流量费，由运营商收取。<br>
  5.5 产品推荐：用户在此同意，为提高用户体验，本软件上提供推荐和安装好物的其他相关产品的功能，用户可以根据该功能来自主选择下载和安装所推荐的产品。<br>
  5.6 本软件不含有任何旨在破坏用户数据和获取用户隐私信息的恶意代码，不含有任何监控、监视用户的功能代码，不会收集用户个人文件、文档等信息，不会泄漏用户隐私。<br>
  5.7 用户应在遵守法律及本协议的前提下使用本软件。用户无权实施包括但不限于下列行为：<br>
  5.7.1 删除或者改变本软件上的所有权利管理电子信息。<br>
  5.7.2 故意避开或者破坏著作权人为保护本软件著作权而采取的技术措施。<br>
  5.7.3 利用本软件误导、欺骗他人。<br>
  5.7.4 违反国家规定，对计算机信息系统功能进行删除、修改、增加、干扰，造成计算机信息系统不能正常运行。<br>
  5.7.5 未经允许，进入计算机信息网络或者使用计算机信息网络资源。<br>
  5.7.6 未经允许，对计算机信息网络功能进行删除、修改或者增加。<br>
  5.7.7 未经允许，对计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加。<br>
  5.7.8 破坏本软件系统或网站的正常运行，故意传播计算机病毒等破坏性程序。<br>
  5.7.9 其他任何危害计算机信息网络安全的行为。<br>
  5.8 对于从非好物指定站点下载的本软件产品以及从非好物发行的介质上获得的本软件产品，好物无法保证该软件是否感染计算机病毒、是否隐藏有伪装的特洛伊木马程序或者黑客软件，使用此类软件，将可能导致不可预测的风险，建议用户不要轻易下载、安装、使用，好物不承担任何由此产生的一切法律责任。<br>
  5.9 隐私权保护<br>
  5.9.1 好物承诺遵守《好物用户隐私保护白皮书》以及适用法律的规定。<br>
  5.9.2 检查软件版本的更新。<br>
  软件在启动后，会通过使用唯一设备码、版本号等信息，和服务器进行交互，来检查是否有可供更新的重要版本，如果存在会给出提示，您可以选择是否升级。<br>
  您也可以在本软件的“反馈->关于->检查更新”中手动检查版本更新。版本更新提示出现时，您可以选择是否升级。<br>
  5.9.3 用户反馈。<br>
  您可以通过反馈，提出你的反馈意见，反馈不会携带任何用户个人信息。<br>
  5.9.4 用户清理痕迹。<br>
  用户使用过程中产生的使用记录，只会保存到用户手机，不会上传到服务器。<br>
  5.9.5 好物制定了严格的用户上传信息处理规则和安全保护措施来确保不超越目的和范围收集用户信息，确保用户上传信息的安全，确保用户上传信息不被滥用。除征得用户明确同意和法律明确规定外，好物不会向任何第三方提供用户上传文件及信息。<br>
  5.9.6 好物制定了以下四项隐私权保护原则，指导好物处理产品及服务中涉及到用户隐私权和用户信息等方面的问题：<br>
  (1)利用我们收集的信息为用户提供有价值的产品和服务。<br>
  (2)开发符合隐私权标准和隐私权惯例的产品。<br>
  (3)将个人信息的收集透明化，并由权威第三方监督。<br>
  (4)尽最大的努力保护我们掌握的信息。<br>
  您可通过好物互联网安全中心网站查看好物有关隐私保护的详细内容。<br>
  5.10 用户体验改进计划：为了改善产品的用户体验，好物会根据需要对产品的各功能使用情况进行统计，这些统计一般为每个功能的使用次数。通过分析统计数据可以提高产品质量，并且推出对用户有帮助的创新安全服务。统计只对好物产品自身的内容进行，绝不涉及用户的个人数据。统计方法为访问好物服务器的一个页面，服务器根据该页面的被访问次数统计以上行为的发生次数。<br>
  5.11 程序错误日志上报：当程序出现意外错误或崩溃时，会自动生成一个错误日志。本软件根据需要会向好物安全中心上报错误日志，以便定位程序错误或崩溃的原因，改善产品质量。在需要用户上报错误日志时，本软件会询问用户是否同意上报。如果用户同意上报，本软件会将此错误日志上报给好物安全中心；如果用户不同意，则不会上报。错误日志是好物程序在出现错误或崩溃时记录的运行信息，仅包含程序本身的出错信息，绝不涉及任何用户个人数据。<br>
  5.12 未经好物许可，用户不得擅自对“洋葱视频”上的资讯内容进行复制、修改、链接、转载、建立镜像站点等好物未明示授权的行为。<br>
  <span class="sm-title">6、用户使用软件规范</span>
  6.1 您在使用本软件时，不得从事以下行为，包括但不限于：<br>
  （1）反对宪法所确定的基本原则的。<br>
  （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的。<br>
  （3）损害国家荣誉和利益的。<br>
  （4）煽动民族分裂、侵害少数民族风俗习惯，破坏民族团结。<br>
  （5）破坏国家宗教政策，宣扬邪教和封建迷信的。<br>
  （6）散布谣言，扰乱社会秩序，破坏社会稳定的。<br>
  （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的。<br>
  （8）侮辱或者诽谤他人，以及侵害他人合法权益的其他情形。<br>
  （9）法律、法规和政策禁止的其他内容。<br>
  6.2 用户可以使用本软件发表观点、看法、评论，包括数据、图片、音频、视频、链接等形式。您需保证对上传的内容拥有完整的知识产权或是已经取得合法授权，且未侵犯任何第三方合法权益。<br>
  6.3 用户不得实施通过插件、外挂或第三方工具对“洋葱视频”的正常运行进行干扰、破坏、修改或施加其他影响。<br>
  6.4 未经好物许可，用户不得在“洋葱视频”中实施发布广告、推销商品及服务。<br>
  6.5 用户在发表评论或跟帖时，应当严格遵守法律法规的规定，不得发表包括但不限于以下内容：<br>
  （1）发布商业广告或类似的商业招揽行为。<br>
  （2）发布、传播广告信息或垃圾信息。<br>
  （3）虚构事实、隐瞒真相等方式误导、欺骗他人。<br>
  （4）散布污言秽语，损害社会公序良俗的情形。<br>
  （5）侵犯他人的著作权、商标权等知识产权。<br>
  （6）发布与所评论的资讯无关的内容，或毫无意义的内容。<br>
  （7）使用常用语言文字以外的其他语言文字评论。<br>
  （8）以任何形式发表的用以逃避好物审核的内容。<br>
  （9）法律法规禁止传播的其他信息。<br>
  6.6 如您使用软件违反本协议的规定，或违反法律法规政策的，好物有权不经通知，停止向您提供服务，注销您的注册账号，并向有关部门报告。<br>
  6.7 如您在使用软件的过程中，包括上传内容及发表评论等行为，损害任何第三方的合法权益，您需独立承担责任。如好物因您的行为而承担责任的，您需赔偿好物的全部损失。<br>
  <span class="sm-title">7、知识产权</span>
  7.1 除非另有约定或另行声明，“洋葱视频” 的一切知识产权，以及与“洋葱视频”相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图像、图表、色彩、界面设计、版面框架、有关数据、附加程序、印刷材料或电子文档等均为好物所有（用户依法享有版权的内容除外），受著作权法和国际著作权条约以及其他知识产权法律法规的保护。<br>
  7.2 用户使用洋葱视频平台上传、发布或传输内容即代表了您有权且同意在全世界范围内，永久性的、不可撤销的、免费的授予我方对该内容的存储、使用、发布、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示等权利；将内容的全部或部分编入其他任何形式的作品、媒体、技术中的权利；对您的上传、发布的内容进行商业开发的权利；通过有线或无线网络向计算机终端、移动通讯终端（包括但不限于便携式通讯设备如手机和智能平板电脑等）及其他带由互联网接入功能的设备等提供内容下载、点播、数据传输及其相关的宣传和推广等服务的权利；以及再授权给其他第三方以上述方式使用的权利。<br>
  7.3 经由洋葱视频发布、传输的内容，受到著作权法、商标法、专利法和他法律的保护；除内容上传的用户所享有的版权，未经洋葱视频明示授权许可，其他用户不得进行复制、修改、转载或衍生其他作品。<br>
  <span class="sm-title">8、免责与责任限制</span>
  8.1 用户确认，其知悉本软件所有功能及好物为实现本软件各功能所进行的必要操作，其根据自身需求自愿选择使用本软件及相关服务，因使用本软件及相关服务所存在的风险和一切后果将完全由其自己承担，好物不承担任何责任。<br>
  8.2 洋葱视频仅为用户提供信息存储空间的网络技术服务。在洋葱视频上制作、上传、发布、传播相关资讯内容，均系用户的独立行为，，与好物无关，也不代表好物的观点和判断。如因用户上传的内容侵犯第三方的合法权益，由实际提供该资讯内容的用户独立承担责任。<br>
  8.3 若权利人认为洋葱视频的资讯内容侵犯知识产权（包括著作权、商标专用权等）、名誉权、肖像权、个人隐私权等合法权益，请权利人及时联系“洋葱视频”，并提交书面通知，要求删除涉嫌侵权的资讯内容。该通知书应当包括下列内容：<br>
  （1）权利人的姓名（名称）、联系电话和通讯地址。<br>
  （2）要求删除的涉嫌侵权资讯内容的具体名称及其对应的网络地址。<br>
  （3）构成侵权的初步证明材料、权利权属证明等。<br>
  请权利人按照洋葱视频公示的投诉指引与好物取得联系。<br>
  好物作为中立的网络信息技术服务提供者，将根据权利人发送的“通知”移除相关内容或链接，被移除的资讯内容提供者可以依法向“洋葱视频”发出关于被移除资讯内容不侵犯著作权或其他合法权益的反通知（应含相应证明材料）。好物将在接到反通知并审核无误后的合理时间内恢复被移除的资讯内容，且依法对该恢复行为不承担法律责任。<br>
  8.4 本软件经过详细的测试，但不能保证与所有的软硬件系统完全兼容，不能保证本软件完全没有错误。如果出现不兼容及软件错误的情况，用户可拨打技术支持电话将情况报告好物，获得技术支持。如果无法解决兼容性问题，用户可以删除本软件。<br>
  8.5 在适用法律允许的最大范围内，对因使用或不能使用本软件所产生的损害及风险，包括但不限于直接或间接的个人损害、商业赢利的丧失、贸易中断、商业信息的丢失或任何其它经济损失，好物不承担任何责任。<br>
  8.6 对于因电信系统或互联网网络故障、计算机故障或病毒、信息损坏或丢失、计算机系统问题或其它任何不可抗力原因而产生损失，好物不承担任何责任。<br>
  8.7 用户违反本协议规定，对好物造成损害的。好物有权采取包括但不限于中断使用许可、停止提供服务、限制使用、法律追究等措施。<br>
  <span class="sm-title">9、法律及争议解决</span>
  9.1 本协议适用中华人民共和国法律。<br>
  9.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决。协商不成时，任何一方均可将有关争议提交至被告住所地有管辖权的法院诉讼解决。<br>
  <span class="sm-title">10、其他条款</span>
  10.1 如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力。<br>
  10.2 好物有权随时根据有关法律、法规的变化以及公司经营状况和经营策略的调整等修改本协议。修改后的协议会在好物官方网站（www.haowu.com）上公布，并随附于新版本软件。当发生有关争议时，以最新的协议文本为准。如果不同意改动的内容，用户可以自行删除本软件。如果用户继续使用本软件，则视为您接受本协议的变动。<br>
  10.3 好物在法律允许的最大范围内对本协议拥有解释权与修改权。<br>
  有任何问题，请联系：<br>
  kefu@haowu.cn</p>
      </div>
    </scroll>
  </div>
</template>

<script>
import Scroll from 'components/scroll/scroll'
export default {
  components: {
    Scroll
  }
}
</script>

<style scoped lang="scss">
.scroll {
  position: absolute;
  width: 100%;
  top: 0;
  bottom: 0;
}
  .inner {
    width: 100%;
    box-sizing: border-box;
    padding: .4rem;
    background-color: #fff;
    color: #333;
    .title {
      font-size: .48rem;
      text-align: center;
      font-weight: 800;
    }
    .text {
      font-size: .4rem;
      line-height: 1.5;
      margin: .27rem 0 0;
    }
    .sm-title {
      font-size: .43rem;
      font-weight: 800;
      margin-top: .53rem;
      margin-bottom: .27rem;
      display: block;
    }
  }
</style>
